In [1]:
import numpy as np
import pandas as pd

### 연습문제 4.1.1  

(1) 임의로 두 개의 시리즈 객체를 만든다.  
모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

In [2]:
a = pd.Series([99, 37, 51, 65],
              index=["A", "B", "C", "D"])
b = pd.Series([59, 77, 81, 95],
              index=["A", "B", "H", "I"])

In [3]:
a

A    99
B    37
C    51
D    65
dtype: int64

In [4]:
b

A    59
B    77
H    81
I    95
dtype: int64

(2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [5]:
a+b

A    158.0
B    114.0
C      NaN
D      NaN
H      NaN
I      NaN
dtype: float64

In [6]:
a - b

A    40.0
B   -40.0
C     NaN
D     NaN
H     NaN
I     NaN
dtype: float64

In [7]:
a * b

A    5841.0
B    2849.0
C       NaN
D       NaN
H       NaN
I       NaN
dtype: float64

In [8]:
a / b

A    1.677966
B    0.480519
C         NaN
D         NaN
H         NaN
I         NaN
dtype: float64

### 연습 문제 4.1.2

다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.  

(1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.  

(2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [9]:
data = {'이름' : ['A','B','C','D','E'],
        '영어' : [12,57,89,24,57],
        "수학" : [55,57,81,44,28],
        "국어" : [78,22,57,87,99],
        "사회" : [88,25,77,59,39]
}

columns = ['이름','영어','수학','국어','사회']
index = [1,2,3,4,5]
df = pd.DataFrame(data,index = index,columns= columns)
df['평균'] = df.mean(axis=1)

df

  이름  영어  수학  국어  사회     평균
1  A  12  55  78  88  58.25
2  B  57  57  22  25  40.25
3  C  89  81  57  77  76.00
4  D  24  44  87  59  53.50
5  E  57  28  99  39  55.75

### 연습 문제 4.1.3

In [10]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

(1) 모든 학생의 수학 점수를 시리즈로 나타낸다.

In [11]:
df.수학

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

(2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

In [12]:
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

(3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

In [13]:
df['평균'] = np.round(df.mean(axis=1),2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

(4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

In [14]:
df.국어[3] = 80
df['평균'] = np.round(df.mean(axis=1),2)
df

<ipython-input-14-f634d7daad39>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.국어[3] = 80

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  80  40  70  59.17

(5) 춘향의 점수를 데이터프레임으로 나타낸다.

In [15]:
df[:1]

    국어  영어  수학     평균
춘향  80  90  90  86.67

(6) 향단의 점수를 시리즈로 나타낸다.

In [16]:
df.loc['향단',:]

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

### 연습 문제 4.3.1
1. 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.

In [17]:
data = {'이름' : ['A','B','C','D','E'],
        '영어' : [12,57,89,24,57],
        "수학" : [55,57,81,44,28],
        "국어" : [78,22,57,87,99],
        "사회" : [88,25,77,59,39]
}

columns = ['이름','영어','수학','국어','사회']
index = [1,2,3,4,5]
df = pd.DataFrame(data,index = index,columns= columns)
df['평균'] = df.mean(axis=1)

df

  이름  영어  수학  국어  사회     평균
1  A  12  55  78  88  58.25
2  B  57  57  22  25  40.25
3  C  89  81  57  77  76.00
4  D  24  44  87  59  53.50
5  E  57  28  99  39  55.75

2. 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [18]:
# 1
df['이름']

# 2
1
df['이름']

# 2
df.사회

1    88
2    25
3    77
4    59
5    39
Name: 사회, dtype: int64

In [19]:
# 2
df.사회

1    88
2    25
3    77
4    59
5    39
Name: 사회, dtype: int64

In [20]:
# 3
df.iloc[-1]

이름        E
영어       57
수학       28
국어       99
사회       39
평균    55.75
Name: 5, dtype: object

In [21]:
# 4
df.loc[3]

이름       C
영어      89
수학      81
국어      57
사회      77
평균    76.0
Name: 3, dtype: object

In [22]:
# 5
df.loc[[2],['영어','평균']]

   영어     평균
2  57  40.25

In [23]:
# 6
df.loc[3:]

  이름  영어  수학  국어  사회     평균
3  C  89  81  57  77  76.00
4  D  24  44  87  59  53.50
5  E  57  28  99  39  55.75

In [24]:
# 7
df.iloc[:,-1]

1    58.25
2    40.25
3    76.00
4    53.50
5    55.75
Name: 평균, dtype: float64

In [25]:
# 8

df.loc[:,"이름":"수학"]

  이름  영어  수학
1  A  12  55
2  B  57  57
3  C  89  81
4  D  24  44
5  E  57  28

In [26]:
# 9

df.loc[4:, "평균"]

4    53.50
5    55.75
Name: 평균, dtype: float64

In [27]:
# 10

df.iloc[1:5, -2:]

   사회     평균
2  25  40.25
3  77  76.00
4  59  53.50
5  39  55.75

### 연습 문제 4.4.1

타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.

In [28]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [29]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

### 연습 문제 4.4.2

sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [30]:
titanic[['sex','age','class','alive']].count().sort_values()

age      714
sex      891
class    891
alive    891
dtype: int64

### 연습 문제 4.4.3  

1. 타이타닉호 승객의 평균 나이를 구하라.

In [31]:
titanic.age.mean()

29.69911764705882

2. 타이타닉호 승객중 여성 승객의 평균 나이를 구하라.

In [32]:
titanic[titanic.sex == 'female'].age.mean()

27.915708812260537

3.타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.

In [33]:
titanic[np.logical_and(titanic['class'] == "First",titanic['sex']=="female")].age.mean()

34.61176470588235

### 연습 문제 4.4.4

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라.  
category1 카테고리는 다음과 같이 정의된다.  

20살이 넘으면 성별을 그대로 사용한다.  

20살 미만이면 성별에 관계없이 “child”라고 한다.

In [34]:
titanic['category1'] = titanic.apply(lambda r : r.sex if r.age >= 20 else 'child', axis = 1)
titanic[['sex','age','category1']].head(10)

      sex   age category1
0    male  22.0      male
1  female  38.0    female
2  female  26.0    female
3  female  35.0    female
4    male  35.0      male
5    male   NaN     child
6    male  54.0      male
7    male   2.0     child
8  female  27.0    female
9  female  14.0     child

### 연습 문제 4.4.5

타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.

In [35]:
avg_age = titanic.age.mean()
titanic['age'] = titanic['age'].fillna(avg_age)
titanic['age']

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, Length: 891, dtype: float64

### 연습 문제 4.4.6

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category2 열을 만들어라.  category2 카테고리는 다음과 같이 정의된다.  

- 성별을 나타내는 문자열 male 또는 female로 시작한다.  

- 성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 온다.  

- 예를 들어 27살 남성은 male27 값이 된다.

In [36]:
titanic['category2'] = titanic.apply(lambda r : r.sex + str(int(r.age)), axis = 1)
titanic[['sex','age','category2']].head(10)

      sex        age category2
0    male  22.000000    male22
1  female  38.000000  female38
2  female  26.000000  female26
3  female  35.000000  female35
4    male  35.000000    male35
5    male  29.699118    male29
6    male  54.000000    male54
7    male   2.000000     male2
8  female  27.000000  female27
9  female  14.000000  female14

### 연습 문제 4.4.7
타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나눈다.  
그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다.

In [37]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

groups = pd.cut(titanic['age'], bins, labels=labels)
(pd.value_counts(groups) /len(groups)) * 100

청년      45.679012
중년      27.048260
미성년자    18.518519
장년       6.621773
노년       0.561167
Name: age, dtype: float64

In [38]:
groups

0        청년
1        중년
2        청년
3        중년
4        중년
       ...
886      청년
887    미성년자
888      청년
889      청년
890      중년
Name: age, Length: 891, dtype: category
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

### 연습 문제 4.4.8

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category3 열을 만들어라.  category3 카테고리는 다음과 같이 정의된다.  

- 20살 미만이면 성별에 관계없이 “미성년자”라고 한다.  

- 20살 이상이면 나이에 따라 “청년”, “중년”, “장년”, “노년”을 구분하고 그 뒤에 성별을 나타내는 “남성”, “여성”을 붙인다.

In [39]:
titanic['group'] = pd.cut(titanic.age, bins, labels=labels)
titanic.group

0        청년
1        중년
2        청년
3        중년
4        중년
       ...
886      청년
887    미성년자
888      청년
889      청년
890      중년
Name: group, Length: 891, dtype: category
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [40]:
titanic['category3'] = titanic.apply(lambda r : r.group if r.age < 20 \
    else str(r.group) + ("여성" if r.sex == 'female' else "남성") , axis = 1)
titanic[['sex','age','category3']].head(10)

      sex        age category3
0    male  22.000000      청년남성
1  female  38.000000      중년여성
2  female  26.000000      청년여성
3  female  35.000000      중년여성
4    male  35.000000      중년남성
5    male  29.699118      청년남성
6    male  54.000000      장년남성
7    male   2.000000      미성년자
8  female  27.000000      청년여성
9  female  14.000000      미성년자

### 연습 문제 4.5.1

5명의 학생의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.  

- 학생 이름을 나타내는 열을 포함시키지 않고 데이터프레임 df_score1 을 생성한 후, df_score1.index 속성에 학생 이름을 나타내는 열을 지정하여 인덱스를 지정한다. reset_index 명령으로 이 인덱스 열을 명령으로 일반 데이터열로 바꾸여 데이터프레임 df_score2을 만든다.  

- 학생 이름을 나타내는 열이 일반 데이터 열을 포함하는 데이터프레임 df_score2에 set_index 명령을 적용하여 다시 학생 이름을 나타내는 열을 인덱스로 변경한다.

In [41]:
data = {
        '영어' : [12,57,89,24,57],
        "수학" : [55,57,81,44,28],
        "국어" : [78,22,57,87,99]
}

columns = ['영어','수학','국어']
df_score1 = pd.DataFrame(data,columns= columns)

df_score1

   영어  수학  국어
0  12  55  78
1  57  57  22
2  89  81  57
3  24  44  87
4  57  28  99

In [42]:
df_score1.index = ['A','B','C','D','E']
df_score1

   영어  수학  국어
A  12  55  78
B  57  57  22
C  89  81  57
D  24  44  87
E  57  28  99

In [43]:
df_score2 = df_score1.reset_index()
df_score2

  index  영어  수학  국어
0     A  12  55  78
1     B  57  57  22
2     C  89  81  57
3     D  24  44  87
4     E  57  28  99

In [44]:
df_score2.set_index("index",inplace=True)
df_score2.index.name="학생이름"
df_score2

      영어  수학  국어
학생이름
A     12  55  78
B     57  57  22
C     89  81  57
D     24  44  87
E     57  28  99